app/controllers/home_pages_controller.rb

SELECT "home_pages".* FROM "home_pages" LIMIT $1  [["LIMIT", 11]]
---
  def index
    @home_pages = HomePage.all

INSERT INTO "home_pages" ("title", "author", "genre", "price", "publishedDate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @home_page = HomePage.new(home_page_params)

    respond_to do |format|
      if @home_page.save

DELETE FROM "home_pages" WHERE "home_pages"."id" = $1  [["id", 12]]
---
  def destroy
    @home_page.destroy

SELECT "home_pages".* FROM "home_pages" WHERE "home_pages"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_home_page
      @home_page = HomePage.find(params[:id])